{
  "title": "Simple Analysis - Community Food Pantry",
  "description": "Demonstrates the simple analysis workflow with /analyze and /recommend endpoints",
  
  "step_1_analyze": {
    "endpoint": "/analyze",
    "method": "POST",
    "request": {
      "problem_statement": "Our community food pantry serves 300 families monthly but struggles with volunteer scheduling conflicts and inventory tracking across our 3 distribution sites. We currently use paper forms and phone calls which leads to missed shifts and food waste."
    },
    "response": {
      "problem_id": "PF4A8B2C9",
      "description": "Community food pantry faces operational inefficiencies due to manual volunteer coordination and lacks real-time inventory visibility across multiple distribution sites, resulting in resource waste and service gaps.",
      "clarifying_questions": [
        "What are your peak volunteer hours and how many volunteers do you typically need per distribution site?",
        "What types of inventory do you track (perishable vs non-perishable) and what triggers food waste currently?"
      ]
    }
  },

  "step_2_recommend": {
    "endpoint": "/recommend", 
    "method": "POST",
    "request": {
      "problem_id": "PF4A8B2C9",
      "description": "Community food pantry faces operational inefficiencies due to manual volunteer coordination and lacks real-time inventory visibility across multiple distribution sites, resulting in resource waste and service gaps.",
      "clarifying_questions": [
        "We need 8-12 volunteers per site during our Tuesday and Friday distributions, with backup coverage for sick volunteers",
        "We track both perishable and non-perishable items, with most waste coming from expired dairy and produce that sits too long at one site while another runs out"
      ]
    },
    "response": {
      "solution_summary": "Implement integrated volunteer management and inventory tracking system with real-time visibility across all distribution sites, automated scheduling with backup protocols, and inventory redistribution alerts to minimize food waste.",
      "recommended_tech_stack": [
        "VolunteerHub - Volunteer scheduling with automated backup notifications and shift reminders",
        "Pantry Soft - Multi-location inventory management with expiration date tracking and inter-site transfer recommendations", 
        "Slack or Microsoft Teams - Real-time communication between site coordinators for inventory alerts",
        "Google Calendar - Centralized distribution schedule visible to all volunteers and coordinators"
      ],
      "initial_steps": [
        "Set up VolunteerHub with all volunteer profiles and create recurring shift templates for Tuesday/Friday distributions",
        "Configure Pantry Soft with current inventory data from all 3 sites and set up expiration date alerts",
        "Establish daily inventory sharing protocol between sites using Teams/Slack for redistribution coordination",
        "Train site coordinators on the new systems and create volunteer onboarding materials for the digital tools"
      ]
    }
  },

  "key_features": {
    "analysis_type": "Simple/Basic",
    "workflow": "/analyze → /recommend",
    "input_fields": ["problem_statement"],
    "output_structure": "Clean JSON with problem_id, description, clarifying_questions, solution_summary, tech_stack, initial_steps",
    "use_case": "Quick operational analysis with practical technology recommendations"
  }
}